In [ ]:
#Table of contents
#THis inclusdes changing column names, data types, and final checks before using this data

In [1]:
#Import Libraries

import pandas as pd
import numpy as np
import os

In [2]:
customers=pd.read_csv(r'/Users/hillelkrief1/Desktop/CareerFoundry/Course 2 Data Immersion/Achievement 4/Instacart Basket Analysis 08-2022/02 Data/4.3_orders_products/customers.csv',index_col=False)

In [3]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
#No columns here need to be dropped, however Surnam should be spelled surname so I will change that

customers.rename(columns = {'Surnam' : 'Surname'}, inplace = True)

In [5]:
customers.head()

,user_id,First Name,Surname,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
#change the data type of user_id to string
customers['user_id'] = customers['user_id'].astype('str')

In [8]:
customers.describe()

                 Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [9]:
#Checking for a mixed datatype

for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

First Name

In [10]:
#Since we see that First Name columb is mixed we must make it string

customers['First Name'] = customers['First Name'].astype('str')

In [11]:
#Checking for a mixed datatype one last time to be sure

for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

In [12]:
#Checking for nulls and then duplicates

customers.isnull().sum()

user_id         0
First Name      0
Surname         0
Gender          0
STATE           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [13]:
cust_dups = customers[customers.duplicated()]

In [14]:
cust_dups

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, STATE, Age, date_joined, n_dependants, fam_status, income]
Index: []

In [15]:
customers.to_csv(r'/Users/hillelkrief1/Desktop/CareerFoundry/Course 2 Data Immersion/Achievement 4/Instacart Basket Analysis 08-2022/02 Data/Prepared Data/customers_cleaned.csv')

In [16]:
#Combining the customers data with Orders and Products

In [19]:
ords_prods=pd.read_pickle(r'/Users/hillelkrief1/Desktop/CareerFoundry/Course 2 Data Immersion/Achievement 4/Instacart Basket Analysis 08-2022/02 Data/Prepared Data/ords_prods_grouped.pkl')

In [20]:
print(ords_prods.columns.tolist())

['product_id', 'product_name', 'aisle_id', 'department_id', 'prices', 'Unnamed: 0.1', 'Unnamed: 0', 'order_id', 'user_id', 'order_number', 'orders_day_of_week', 'order_hour_of_day', 'days_since_prior_order', 'add_to_cart_order', 'reordered', '_merge', 'price_range_loc', 'busiest_day', 'busiest_period_of_day', 'max_order', 'loyalty_flag', 'mean_orders', 'spender_flag', 'median_orders', 'frequency_flag']

In [21]:
print(customers.columns.tolist())

['user_id', 'First Name', 'Surname', 'Gender', 'STATE', 'Age', 'date_joined', 'n_dependants', 'fam_status', 'income']

In [22]:
ords_prods['user_id'].dtype

dtype('int64')

In [23]:
customers['user_id'].dtype

dtype('O')

In [24]:
#Since the user ID isn't a number rather what we'd call ordianl we should make it integer! Especially since we are combining it with another string user_id
customers['user_id'] = customers['user_id'].astype('int64')

In [25]:
customers['user_id'].dtype

dtype('int64')

In [26]:
#Checking the shapes

In [27]:
customers.shape

(206209, 10)

In [28]:
ords_prods.shape

(32404859, 25)

In [29]:
ords_prods=ords_prods.drop(columns= ['_merge'])

In [30]:
ords_prods_custs= ords_prods.merge(customers, on = 'user_id', how='outer', indicator = True)

In [31]:
ords_prods_custs['_merge'].value_counts(dropna=False)

left_only     30451394
both           1953465
right_only       12519
Name: _merge, dtype: int64